// 1. завантаження даних -> відображення статуту завантаження
// 2. відображення даних що ми завантажили + конвертація даних
// 3. в разі помилки відображаємо статус помилки

//клас роботи зі списком (завантаження/відображення)
export class List {
  //константа статусів завантаження
  STATE = {
    LOADING: 'loading',
    SUCCESS: 'success',
    ERROR: 'error',
  }

  //властивість статуса, що приймає одне з значень константи STATE
  status = null

  //властивість даних, що ми завантажуємо з сервера
  data = null

  //властивість елемента в якому будуть відображатися дані
  element = null

  //функція оновлення статусу завантаження
  updateStatus = (status, data) => {
    this.status = status
    if (data) this.data = data

    this.updateView()
  }

  //метод оновлення відображення завантажених даних на сторінці з урахуванням статуса завантаження
  updateView = () => {}

  //метод завантаження даних
  loadData = async () => {}

  //мметод конвертування даних з JSON  в формат зручний для відображення
}
