//визначає на яку сторінку перейти в залежності від реєстрації користувача

//буде виконувати певний код, після завантаження контенту
document.addEventListener('DOMContentLoaded', () => {
  //якщо існує session(у користувача є акаунт), то отримуємо данні про користувача
  if (window.session) {
    const { user } = window.session //деструктурізація

    // console.log(user)

    //якщо користувач підтвердив пошту
    if (user.isConfirm) {
      location.assign('/home') //перехід на домашнюю сторінку, що доступна лише після вводу в акаунт
    } else {
      location.assign('/signup-confirm') //перехід на сторінку підтвердження пошти
    }

    //визначаємо на яку сторінку перейти
  } else {
    //якщо сесії не існує у користувача немає акаунта), то направляємо користувача на сторінку реєстрації
    location.assign('/signup')
  }
})
